ch2/ch2-3.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-02-24 Mon 06:25 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Chapter 2.3</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="pedh" />
<link rel="stylesheet" type="text/css" href="/css/org-info.css" />


</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/CLRS-Solutions"> UP </a>
 |
 <a accesskey="H" href="/CLRS-Solutions"> HOME </a>
</div><div id="content">
<h1 class="title">Chapter 2.3</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgbc971d0">ch2.3</a>
<ul>
<li><a href="#org76527a6">2.3-1</a></li>
<li><a href="#orgef3ba46">2.3-2</a></li>
<li><a href="#org33a46d3">2.3-3</a></li>
<li><a href="#orge5d3ba2">2.3-4</a></li>
<li><a href="#org62b4b1b">2.3-5</a></li>
<li><a href="#org78960ea">2.3-6</a></li>
<li><a href="#orgfa0040f">2.3-7</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgbc971d0" class="outline-2">
<h2 id="orgbc971d0">ch2.3</h2>
<div class="outline-text-2" id="text-orgbc971d0">
</div>
<div id="outline-container-org76527a6" class="outline-3">
<h3 id="org76527a6">2.3-1</h3>
<div class="outline-text-3" id="text-org76527a6">
<pre class="example">
		      +--------------------------------+
		      |  3  9  26  38  41  49  52  57  |
		      +----x----------------------x----+
			  /                        \
			 /          merge           \
	+---------------o---+                   +----o--------------+
	|   3  26  41  52   |                   |   9  38  49  57   |
	+--x-------------x--+                   +--x-------------x--+
	  /               \                       /               \
	 /      merge      \                     /      merge      \
   +----o----+         +----o----+         +----o----+         +----o----+
   |  3  41  |         |  26  52 |         |  38  57 |         |  9  49  |
   +--x---x--+         +--x---x--+         +--x---x--+         +--x---x--+
     /     \             /     \             /     \             /     \
    / merge \           / merge \           / merge \           / merge \
+--o--+   +--o--+   +--o--+   +--o--+   +--o--+   +--o--+   +--o--+   +--o--+
|  3  |   | 41  |   | 52  |   | 26  |   | 38  |   | 57  |   |  9  |   | 49  |
+-----+   +-----+   +-----+   +-----+   +-----+   +-----+   +-----+   +-----+
</pre>
</div>
</div>
<div id="outline-container-orgef3ba46" class="outline-3">
<h3 id="orgef3ba46">2.3-2</h3>
<div class="outline-text-3" id="text-orgef3ba46">
<pre class="example">
MERGE(A, p, q, r)
    n1 = q - p + 1
    n2 = r - q
    let L[1..n1] and R[1..n2] be new arrays
    for i = 1 to n1
	L[i] = A[p + i - 1]
    for j = 1 to n2
	R[j] = A[q + j]
    i = 1
    j = 1
    k = 1
    while i &lt;= n1 and j &lt;= n2
	if L[i] &lt;= R[j]
	    A[k] = L[i]
	    i = i + 1
	else A[k] = R[j]
	     j = j + 1
    if i &gt; n1
	while j &lt;= n2
	    A[k] = R[j]
	    k = k + 1
	    j = j + 1
    else while i &lt;= n1
	     A[k] = L[i]
	     k = k + 1
	     i = i + 1
</pre>
</div>
</div>
<div id="outline-container-org33a46d3" class="outline-3">
<h3 id="org33a46d3">2.3-3</h3>
<div class="outline-text-3" id="text-org33a46d3">
<p>
<b>Base Case:</b> \(T(2) = 2\lg{2}\)
</p>

<p>
<b>Inductive Step:</b> Assume \(T(n) = n\lg{n}\), Then
</p>
\begin{align*}
T(2n)&=2T(n)+2n\\
     &=2n\lg{n}+2n\\
     &=2n\lg(2n)
\end{align*}

<p>
<b>Finally:</b> By induction, we prove that \(T(n) = n\lg{n}\)
when n is an exact power of 2.
</p>
</div>
</div>
<div id="outline-container-orge5d3ba2" class="outline-3">
<h3 id="orge5d3ba2">2.3-4</h3>
<div class="outline-text-3" id="text-orge5d3ba2">
\begin{equation*}
T(n)=
\begin{cases}
0 & \text{if n = 1}\\
T(n-1)+t(n) & \text{if n > 1, $t(n)=\Omega(1)$, $t(n)=O(n)$}
\end{cases}
\end{equation*}
</div>
</div>
<div id="outline-container-org62b4b1b" class="outline-3">
<h3 id="org62b4b1b">2.3-5</h3>
<div class="outline-text-3" id="text-org62b4b1b">
<pre class="example">
BINARY-SEARCH(A, v)
    low = 1
    high = A.length
    while high &gt;= low
	med = (high + low) // 2
	if A[med] == v
	    return med
	else if A[med] &gt; v
	    high = med - 1
	else low = med + 1
    return NIL
</pre>
<p>
The worst case running time is
</p>
\begin{equation*}
T(n)=
\begin{cases}
\Theta(1) & \text{if n = 1}\\
T(\lceil n/2 \rceil)+\Theta(1) & \text{if n > 1}
\end{cases}
\end{equation*}
<p>
Thus,
</p>
\begin{align*}
T(n)& \leq T(2^{\lceil \lg{n} \rceil})\\
    & \leq (\lg{n}+1)\Theta(1)\\
    &=\Theta(\lg{n})
\end{align*}
</div>
</div>
<div id="outline-container-org78960ea" class="outline-3">
<h3 id="org78960ea">2.3-6</h3>
<div class="outline-text-3" id="text-org78960ea">
<p>
No, even we use binary search to find the proper position of the element,
the bigger elements still need to be move forward, the worst-case running
time is \(\Theta(n^2)\).
</p>
</div>
</div>
<div id="outline-container-orgfa0040f" class="outline-3">
<h3 id="orgfa0040f">2.3-7</h3>
<div class="outline-text-3" id="text-orgfa0040f">
<pre class="example">
EXIST-TWO-OF-SUM(S, x)
    A = MERGE-SORT(S)
    for i = 1 to A.length
	k = BINARY-SEARCH(A, x - A[i])
	if i != k
	    return True
    return False
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: pedh</p>
<p class="date">Created: 2020-02-24 Mon 06:25</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
